Revit 2024 API
FaceDetailNode Class
 A base class of output nodes that represent face edges and face silhouettes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public class FaceDetailNode : RenderNode
Visual Basic
Public Class FaceDetailNode _
	Inherits RenderNode
Visual C++
public ref class FaceDetailNode : public RenderNode
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceEdgeNode
 Autodesk.Revit.DB.FaceSilhouetteNode
See Also
FaceDetailNode Members
Autodesk.Revit.DB Namespace